import 'package:flutter/material.dart';

import 'visit_places_list.dart';

class BasterCity extends StatelessWidget {
  String title;
  String image_city;

  BasterCity({required this.title, required this.image_city});

  List<Map<String, String>> listCat = [
    {
      'place_img': 'assets/images/img_dussera.jpg',
      'place_name': "Baster Dussehra",
      'history_place':
          'बस्तर के दशहरा पर्व की, रथयात्रा की शुरूआत सन् 1408 ई. के बाद चालुक्य वंशानुक्रम के चैथे शासक राजा पुरूषोत्तम देव ने की थी। अंचल के आदिवासियों में धार्मिक भावना को सही दिशा प्रदान करने का उद्वेश्य लिये राजा पुरूषोत्तमदेव ने जगन्नाथपुरी की यात्रा और अपनी प्रजा को साथ ले जाने का निश्चय किया। राजा के इस प्रस्ताव से व्यापक प्रभाव पड़ा। लोगों के मन में मुफ्त यात्रा, वह भी राजा के साथ जाने का उमंग के भाव के साथ अंचल के मुरिया, भतरा, गोंड, धाकड़़, माहरा तथा अन्य जातियों के मुखियाओं ने राजा के साथ जाने की मनः स्थिति बनाई। एक शुभ मुुहुर्त देख कर राजा, यह ऐतिहासिक यात्रा के लिये रवाना हुए। इस कष्ट-साध्य यात्रा में पैदल ही जाना था, राजा स्वयं सवारियों का प्रयोग नहीं किया। \n\nएक जनश्रुति के अनुसार राजा पुरूषोत्तमदेव ने अपनी प्रजा एवं सैन्यदल के साथ जगन्नाथपुरी पहुंचे। पुरी के राजा को जगन्नाथ स्वामी नें स्वप्न में यह आदेश दिया कि बस्तर नरेश की अगवानी व उनका सम्मान करें, वे भक्ति, मित्रता के भाव से पुरी पहुंँच रहे है। पुरी के नरेश ने बस्तर नरेश का राज्योचित स्वागत किया। बस्तर के राजा ने पुरी के मंदिरों में एक लाख स्वर्ण मुद्राएँ, बहुमूल्य रत्न आभूषण और बेशकीमती हीरे-जवाहरात जगन्नाथ स्वामी के श्रीचरणों में अर्पित किया। जगन्नाथ स्वामी ने प्रसन्न होकर सोलह चक्कों का रथ राजा को प्रदान करने का आदेश प्रमुख पुजारी को दिया। इसी रथ पर चढ़कर बस्तर नरेश और उनके वंशज दशहरा पर्व मनायें साथ ही ‘लहुरी रथपति’ की उपाधि देने का निर्देश दिया। राजा पुरूषोत्तमदेव को लहुरी रथपति की उपाधि से विभूषित किया गया। \n\n\nपुरी नरेश से स्थायी मैत्री संधि कर बस्तर नरेश वापस लौटे, साथ में भगवान जगन्नाथ, बलभद्र सुभद्रा की काष्ठ प्रतिमा अपने साथ लाए और भगवान की पूजा अर्चना के लिए कुछ आरण्यक ब्राह्मण परिवारों को भी अपने साथ लेकर आये, जो आगे चलकर बस्तर राज्य में ही बस गए। राजा पुरूषोत्तम देव ने जगन्नाथपुरी से वरदान स्वरूप मिले सोलह चक्कों के रथ का विभाजन करते हुए रथ के चार चक्कों को भगवान जगन्नाथ को समर्पित कर दियाnऔर शेष 12 पहियों का विशाल काष्ठ रथ माँ दन्तेश्वरी को अर्पित कर दिया, तब से दशहरा में दन्तेश्वरी के छत्र के साथ राजा स्वयं भी रथारूढ़ होने लगे। मधोता ग्राम में पहली बार दशहरा रथ यात्रा संवत् 1468-69 (1411-12 ई.) के लगभग प्रारंभ हुई। कई वर्षों के बाद 12 चक्कों के रथ संचालन में असुविधा होने के कारण आठवें क्रम के शासक राजा वीरसिंह ने संवत् 1610 के पश्चात् आठ पहियों का विजय रथ और चार पहियों का फूल रथ प्रयोग में लाया। तब से लेकर यह परम्परा आज भी निर्बाध रूप से जारी है। \n\n\n यहाँ रावण नहीं मारा जाता | \n\n\nबस्तर दशहरा की अपनी विशिष्ट पहचान है। दशहरे का वैभव ही कुछ ऐसा है कि सबको आकर्षित करता है। असत्य पर सत्य के विजय के प्रतीक, महापर्व दशहरे को पूरे देश में राम का रावण से युद्ध में विजय के रूप में विजयादशमी के दिन मनाया जाता है, किन्तु बस्तर दशहरा देश का ही नहीं, वरन् पूरे विश्व का अनूठा महापर्व है, जो असत्य पर सत्य की विजय का प्रतीक तो है, मगर बस्तर दशहरा में रावण नहीं मारा जाता, रामायण से इसका कोई संबंध नहीं, अपितु बस्तर की आराध्या देवी माँ दन्तेश्वरी सहित अनेक देवी-देवताओं की 75 दिनों तक पूजा-अर्चना होती है।'
    },
    {
      'place_img': 'assets/images/img_kanger.jpg',
      'place_name': "Kanger Nation Park",
      'history_place':
          "कांगेर घाटी राष्ट्रीयउद्यान का नाम कांगेर नदी से निकला है, जो इसकी लंबाई में बहती है। कांगेर घाटी लगभग 200 वर्ग किलोमीटर में फैला है | \n\nकांगेर घाटी ने 1982 में एक राष्ट्रीय उद्यान की स्थिति प्राप्त की। ऊँचे पहाड़ , गहरी घाटियाँ, विशाल पेड़ और मौसमी जंगली फूलों एवं वन्यजीवन की विभिन्न प्रजातियों के लिए यह अनुकूल जगह है । कांगेर घाटी राष्ट्रीय उद्यान एक मिश्रित नम पर्णपाती प्रकार के वनों का एक विशिष्ट मिश्रण है जिसमे साल ,सागौन , टीक और बांस के पेड़ बहुताइत में है। यहाँ की सबसे लोकप्रिय प्रजातियां जो अपनी मानव आवाज के साथ सभी को मंत्रमुग्ध करती हैं वह बस्तर मैना है। राज्य पक्षी, बस्तर मैना, एक प्रकार का हिल माइन (ग्रुकुला धर्मियोसा) है, जो मानव आवाज का अनुकरण करने में सक्षम है। जंगल दोनों प्रवासी और निवासी पक्षियों का घर है। \n\nवन्यजीवन और पौधों के अलावा, यह राष्ट्रीय उद्यान तीन असाधारण गुफाओं का घर है- कुटुम्बसर, कैलाश और दंडक-स्टेलेग्माइट्स और स्टैलेक्टसाइट्स के आश्चर्यजनक भूगर्भीय संरचनाओं के लिए प्रसिद्ध है। राष्ट्रीय उद्यान ड्रिपस्टोन और फ्लोस्टोन के साथ भूमिगत चूना पत्थर की गुफाओं की उपस्थिति के लिए जाना जाता है। स्टेलेग्माइट्स और स्टैलेक्टसाइट्स का गठन अभी भी बढ़ रहे हैं। राष्ट्रीय उद्यान में गुफा, वन्यजीवन की विभिन्न प्रजातियों के लिए आश्रय प्रदान करते हैं। राष्ट्रीय उद्यान के पूर्वी हिस्से में स्थित भैंसाधार में रेतीले तट देखे जाते हैं जहां मगरमच्छ (क्रोकोड्लस पालस्ट्रिस) इसका उपयोग मूलभूत उद्देश्यों के लिए करते हैं। \n\n\nतीरथगढ़ झरना कांगेर घाटी राष्ट्रीय उद्यान में स्थित है| इसके साथ ही साथ केंजरधार और भैंसाधार मगरमच्छ पार्क के लिए लोकप्रिय पर्यटक स्थल हैं। पार्क की प्राकृतिक सुंदरता का पता लगाने के लिए जिप्सी सफारी पर्यटकों के लिए उपलब्ध है।"
    },
    {
      'place_img': 'assets/images/img_chitrakoot.jpg',
      'place_name': "Chitrakoot Waterfall",
      'history_place':
          "चित्रकोट जलप्रपात भारत के छत्तीसगढ़ राज्य के बस्तर ज़िले में इन्द्रावती नदी पर स्थित एक सुंदर जलप्रपात है। इस जल प्रपात की ऊँचाई 90 फीट है।इस जलप्रपात की विशेषता यह है कि वर्षा के दिनों में यह रक्त लालिमा लिए हुए होता है, तो गर्मियों की चाँदनी रात में यह बिल्कुल सफ़ेद दिखाई देता है। \n\n\nजगदलपुर से 40 कि.मी. और रायपुर से 273 कि.मी. की दूरी पर स्थित यह जलप्रपात छत्तीसगढ़ का सबसे बड़ा, सबसे चौड़ा और सबसे ज्यादा जल की मात्रा प्रवाहित करने वाला जलप्रपात है। यह बस्तर संभाग का सबसे प्रमुख जलप्रपात माना जाता है। जगदलपुर से समीप होने के कारण यह एक प्रमुख पिकनिक स्पाट के रूप में भी प्रसिद्धि प्राप्त कर चुका है। अपने घोडे की नाल समान मुख के कारण इस जाल प्रपात को भारत का निआग्रा भी कहा जाता है। चित्रकूट जलप्रपात बहुत ख़ूबसूरत हैं और पर्यटकों को बहुत पसंद आता है। सधन वृक्षों एवं विंध्य पर्वतमालाओं के मध्य स्थित इस जल प्रपात से गिरने वाली विशाल जलराशि पर्यटकों का मन मोह लेती है।\n\n‘भारतीय नियाग्रा’ के नाम से प्रसिद्ध चित्रकोट प्रपात वैसे तो प्रत्येक मौसम में दर्शनीय है, परंतु वर्षा ऋतु में इसे देखना अधिक रोमांचकारी अनुभव होता है। वर्षा में ऊंचाई से विशाल जलराशि की गर्जना रोमांच और सिहरन पैदा कर देती है।वर्षा ऋतु में इन झरनों की ख़ूबसूरती अत्यधिक बढ़ जाती है।जुलाई-अक्टूबर का समय पर्यटकों के यहाँ आने के लिए उचित है।चित्रकोट जलप्रपात के आसपास घने वन विराजमान हैं, जो कि उसकी प्राकृतिक सौंदर्यता को और बढ़ा देती है।रात में इस जगह को पूरा रोशनी के साथ प्रबुद्ध किया गया है। यहाँ के झरने से गिरते पानी के सौंदर्य को पर्यटक रोशनी के साथ देख सकते हैं।अलग-अलग अवसरों पर इस जलप्रपात से कम से कम तीन और अधिकतम सात धाराएँ गिरती हैं।"
    },
    {
      'place_img': 'assets/images/img_basterpalace.jpg',
      'place_name': "Baster Palace",
      'history_place':
          "बस्तर पैलेस, शाही परिवार का निवास और जगदलपुर के आकर्षण में से एक है। सरकार ने आसपास के अंदर एक स्मारक बनाया है जहां शाही परिवार के विभिन्न कलाकृतियों और चित्र प्रदर्शित होते हैं|\n\nबस्तर पैलेस जगदलपुर एक और ऐतिहासिक अवशेष है जो जगदलपुर में देखा जाता है। यह बस्तर राजा का मुख्यालय था यह बस्तर राज्य के शासकों द्वारा बनाया गया था जब बस्तर राज्य की राजधानी बरसुर से जगदलपुर में स्थानांतरित कर दी गई थी। वर्तमान में यह सरकार द्वारा स्मारक के रूप में रखे हुए है। छत्तीसगढ़ के जगदलपुर स्थित बस्तर पैलेस छत्तीसगढ़ में स्थित पर्यटन स्थलों में विशेष रैंकिंग है। जगदलपुर शहर छत्तीसगढ़ शहर बस्तर जिले में स्थित इस राज्य का एक प्रमुख और प्रसिद्ध शहर है। ऐतिहासिक स्थलों, प्राकृतिक परिदृश्य और साथ ही जनजातीय संस्कृति पर्यटक आकर्षण हैं। छत्तीसगढ़ राज्य के जगदलपुर के बस्तर पैलेस, इस क्षेत्र के अन्य सभी पर्यटन स्थलों में सबसे ऊपर हैं। यह महल छत्तीसगढ़ के जगदलपुर शहर में स्थित है जो बस्तर जिले के प्रशासन का मुख्यालय है। आगंतुकों के लिए परिवहन की एक बहुत अच्छी सुविधा है जो इस महल का दौरा करना चाहते हैं, यहां कई शटल बसें, कार और टैक्सियां हैं जिन्हें शहर के केंद्र और महल के बीच रखा जा सकता है। "
    },
    {
      'place_img': 'assets/images/img_tirathgarh.jpg',
      'place_name': "Tirathgarh Waterfall",
      'history_place':
          "    तीरथगढ़ वॉटरफॉल छत्तीसगढ़ के बस्तर जिले में जगदलपुर से लगभग 38 किलोमीटर दूर कांगेर नेशनल पार्क में कांगेर नदी की सहायक नदी मुनगा और बहार नदी इस खूबसूरत झरने का निर्माण करती है। इसकी ऊंचाई लगभग 300 फीट है और यह छत्तीसगढ़ का सबसे ऊँचा जलप्रपात है। यह जलप्रपात पहाड़ी के सीढ़ी नुमा प्राकृतिक संरचनाओं पर गिरता है इस कारण पानी दुधिया दिखाई देता हैं जो देखने में बहुत ही मनमोहक होता है। \n\n\nइस खूबसूरत झरने के अलावा यहां धार्मिक स्थल भी है जो भगवान शिव और माता पार्वती को समर्पित है। यहां हजारों की संख्या में पर्यटकों का आगमन होता है और सुंदर दृश्य का लुफ्त उठाते है।"
    },
    {
      'place_img': 'assets/images/img_barush.jpg',
      'place_name': "Barsur Ganesh Temple",
      'history_place':
          "छत्तीसगढ़ के बस्तर जिले में स्थित बारसूर को मंदिरों का शहर भी कहा जाता है। यहां वैसे तो काफी प्रसिद्ध मंदिर स्थित है। लेकिन बारसूर के जुड़वां गणेश मंदिर शायद पूरी दुनिया में अनोखा है। इस मंदिर में दो गणेश प्रतिमा स्थापित किया गया है। एक की ऊंचाई सात फ़ीट और दूसरी की पांच फ़ीट है। इन मूर्ति के निर्माण में कलाकार ने बड़ी ही शानदार कलाकारी दिखाई है।\n\n\nबारसूर शब्द की उत्पत्ति बालसूरी शब्द से मानी जाती है, बालसूरी कालान्तर में बारसूरगढ़ के नाम से प्रसिद्ध हुआ। प्राचीन युग में यह नगरी बेहद समृध्द व वैभवशाली नगरी थी, बारसूर के चारों दिशाओं में यहाँ के शासकों के द्वारा 10-10 मील दूर तक कई मंदिर और तालाब बनवाये जिस कारण इसे मंदिरो और तालाबो कि नगरी भी कहा जाता है।\n\n\nपौराणिक कथा के अनुसार इस मंदिर का निर्माण राजा दैत्येन्द्र बाणासुर ने करवाया था दैत्येन्द्र बाणासुर की पुत्री उषा और उनके मंत्री कुमांद की पुत्री चित्रलेखा के बीच घनिष्ठ मित्रता थी, भगवान गणेश इन दोनों के ही आराध्य देव थे, इनकी अटूट श्रद्धा भक्ति देख राजा बाणासुर ने एक भव्य मंदिर का निर्माण करवाया, जिसमे भगवान गणेश की दो प्रतिमाएं यहाँ एक ही स्थान पर स्थापित करवाईं गई। दोनों ही सखियां इनकी पूजा-अर्चना किया करती थी।"
    },
    {
      'place_img': 'assets/images/img_kutumbsar.jpeg',
      'place_name': "Kutumsar Gufa",
      'history_place':
          "यह गुफा छत्तीसगढ़ के बस्तर जिला में कांकेर घाटी राष्ट्रीय उद्यान में स्थित है । यह भारत की सबसे गहरी गुफा मानी जाती है जो 60 - 120 फिट गहरी है तथा इसकी लम्बाई 4500 फिट है। \n\n इस गुफा की तुलना विश्व की सबसे लम्बी गुफा ' कर्ल्सवार ऑफ़ केव ' (अमेरिका ) से की जाती है। इस गुफा की खोज 1950 के दशक में भूगोल के प्रोफेसर डॉ. शंकर तिवारी ने कुछ स्थानीय आदिवासियों की मदद से की थी । इस गुफा को पहले गोपनसर ( छिपी हुई गुफा )कहते थे जो बाद में कुटुमसर गाँव के नजदीक होने से कुटुमसर गुफा के नाम से प्रसिद्द हुई । इस गुफा में रंग बिरंगी अंधी मछलिया पाई जाती है जिन्हे प्रोफेसर के नाम पर कप्पी ओला शंकराई कहते है। "
    },
  ];

  @override
  Widget build(BuildContext context) {
    listCat.shuffle();
    return Scaffold(
      appBar: AppBar(
        title: Text(
          title,
          style: const TextStyle(
            fontSize: 25,
            fontWeight: FontWeight.bold,
          ),
        ),
      ),
      body: SingleChildScrollView(
        child: Column(
          children: [
            Image.asset(
              '$image_city',
            ),
            const SizedBox(
              height: 10,
            ),
            Padding(
              padding: const EdgeInsets.all(13.0),
              child: Container(
                padding: const EdgeInsets.all(10),
                decoration: BoxDecoration(
                  borderRadius: BorderRadius.circular(15),
                  color: Colors.white,
                  boxShadow: [
                    const BoxShadow(
                      offset: Offset(2, 2),
                      blurRadius: 8,
                      // spreadRadius: 2,
                      color: Colors.grey,
                    ),
                  ],
                ),
                child: const Column(
                  mainAxisAlignment: MainAxisAlignment.start,
                  crossAxisAlignment: CrossAxisAlignment.start,
                  children: [
                    Text(
                      'History :-',
                      textAlign: TextAlign.start,
                      style:
                          TextStyle(fontSize: 22, fontWeight: FontWeight.bold),
                    ),
                    SizedBox(
                      height: 5,
                    ),
                    Text(
                      "बस्तर ,भारत के छत्तीसगढ़ प्रदेश के दक्षिण दिशा में स्थित जिला है। बस्तर जिले एवं बस्तर संभाग का मुख्यालय जगदलपुर शहर है। यह पहले दक्षिण कौशल नाम से जाना जाता था। ख़ूबसूरत जंगलों और आदिवासी संस्कृति में रंगा ज़िला बस्तर, प्रदेश‌ की सांस्कृतिक राजधानी के तौर पर जाना जाता है। 6596.90 वर्ग किलोमीटर में फैला ये ज़िला एक समय केरल जैसे राज्य और बेल्जियम, इज़राइल जैसे देशॊ से बड़ा था। ज़िले का संचालन व्यवस्थित रूप से हो सके इसके लिए 1999 में इसमें से दो अलग ज़िले कांकेर और दंतेवाड़ा बनाए गए। बस्तर जिला छत्तीसगढ़ प्रदेश के कोंडागांव, दन्तेवाडा ,सुकमा, बीजापुर जिलों से घिरा हुआ है।  बस्तर का ज़िला मुख्यालय जगदलपुर, राजधानी रायपुर से 305 किलोमीटर की दूरी पर स्थित है। \n\nबस्तर जिले की जनसंख्या वर्ष 2011 में 834375  थी । जिसमे 413706 पुरुष एवं 420669 महिलाएं थी । बस्तर की जनसन्ख्या मे 70 प्रतिशत जनजातीय समुदाय जैसे गोंड, मारिया, मुरिया, भतरा, हल्बा, धुरुवा समुदाय हैं। बस्तर जिला को सात विकासखण्ड / तहसील जगदलपुर, बस्तर, बकावंड, लोहंडीगुडा, तोकापाल, दरभा और बास्तानार में विभाजित किया गया है। बस्तर जिला सरल स्वाभाव जनजातीय समुदाय और प्राकृतिक सम्पदा संपन्न हुए प्राकृतिक सौन्दर्य एवं सुखद वातावरण का भी धनी है। \n\nउड़ीसा से शुरू होकर दंतेवाड़ा की भद्रकाली नदी में समाहित होने वाली करीब 240 किलोमीटर लंबी इंद्रावती नदी बस्तर के लोगों के लिए आस्था और भक्ति की प्रतीक है। इंद्रावती नदी के मुहाने पर बसा जगदलपुर एक प्रमुख सांस्कृतिक एवं हस्तशिल्प केन्द्र है। यहां मौजूद मानव विज्ञान संग्रहालय में बस्तर के आदिवासियों की सांस्कृतिक, ऐतिहासिक एवं मनोरंजन से संबंधित वस्तुएं प्रदर्शित की गई हैं। डांसिंग कैक्टस कला केन्द्र, बस्तर के विख्यात कला संसार की अनुपम भेंट है। बस्तर जिले के लोग दुर्लभ कलाकृति, उदार संस्कृति एवं सहज सरल स्वभाव के धनी हैं ।\n\nबस्तर जिला घने जंगलों, ऊँची, पहाड़ियों, झरनों, गुफाओ एवं वन्य प्राणियों से भरा हुआ है। बस्तर महल,  बस्तर दशहरा ,दलपत सागर, चित्रकोट जलप्रपात, तीरथगढ़ जलप्रपात, कुटुमसर और कैलाश‌ गुफ़ा आदि पर्यटन के मुख्य केंद्र हैं |\n\nऐतिहासिक रूप से क्षेत्र महाकाव्य रामायण में दंडकारण्य और महाभारत में कोसाला साम्राज्य का हिस्सा है।\n\n\nबस्तर  रियासत  1324 ईस्वी के आसपास स्थापित हुई थी, जब अंतिम काकातिया राजा, प्रताप रुद्र देव ( 12 9 0-1325) के भाई अन्नाम देव ने वारंगल को छोड़ दिया और  बस्तर में अपना शाही साम्रज्य स्थापित किया | महाराजा अन्नम देव के बाद महाराजा हमीर देव , बैताल देव , महाराजा पुरुषोत्तम देव , महाराज प्रताप देव ,दिकपाल देव ,राजपाल देव ने शासन किया |बस्तर शासन की प्रारंभिक राजधानी बस्तर शहर में बसाई गयी , फिर जगदलपुर शहर में स्थान्तरित की गयी । बस्तर में अंतिम शासन महाराजा प्रवीर चन्द्र भंज देव (1936-1948) ने किया । महाराजा प्रवीर चन्द्र भंज देव बस्तर के सभी समुदाय ,  मुख्यतः आदिवासियों के बीच बेहद लोकप्रिय थे। ‘दंतेश्वरी ‘, जो अभी भी बस्तर क्षेत्र  की आराध्य देवी है , प्रसिद्ध दांतेश्वरी मंदिर  दंतेवाड़ा में उनके नाम पर रखा गया है। \n\n1948 में भारत के राजनीतिक एकीकरण के दौरान बस्तर रियासत को भारत में विलय कर दिया गया |",
                      textAlign: TextAlign.start,
                      style: TextStyle(
                        fontSize: 18,
                      ),
                    ),
                  ],
                ),
              ),
            ),
            Padding(
              padding: const EdgeInsets.all(13.0),
              child: Container(
                padding: const EdgeInsets.all(10),
                decoration: BoxDecoration(
                  borderRadius: BorderRadius.circular(15),
                  color: Colors.white,
                  boxShadow: [
                    const BoxShadow(
                      offset: Offset(2, 2),
                      blurRadius: 8,
                      // spreadRadius: 2,
                      color: Colors.grey,
                    ),
                  ],
                ),
                child: const SizedBox(
                  width: double.infinity,
                  child: Row(
                    mainAxisAlignment: MainAxisAlignment.spaceEvenly,
                    crossAxisAlignment: CrossAxisAlignment.start,
                    children: [
                      Icon(
                        Icons.access_time,
                        size: 50,
                        color: Colors.deepPurple,
                      ),
                      Column(
                        children: [
                          Text(
                            'Traveling Best Time  ',
                            textAlign: TextAlign.start,
                            style: TextStyle(
                                fontSize: 22, fontWeight: FontWeight.bold),
                          ),
                          SizedBox(
                            height: 5,
                          ),
                          Center(
                            child: Text(
                              'July to January',
                              textAlign: TextAlign.start,
                              style: TextStyle(
                                fontSize: 18,
                                fontWeight: FontWeight.w600,
                              ),
                            ),
                          ),
                        ],
                      ),
                    ],
                  ),
                ),
              ),
            ),
            Padding(
              padding: const EdgeInsets.all(13.0),
              child: Container(
                padding: const EdgeInsets.all(10),
                decoration: BoxDecoration(
                  borderRadius: BorderRadius.circular(15),
                  color: Colors.white,
                  boxShadow: [
                    const BoxShadow(
                      offset: Offset(2, 2),
                      blurRadius: 8,
                      // spreadRadius: 2,
                      color: Colors.grey,
                    ),
                  ],
                ),
                child: const Column(
                  mainAxisAlignment: MainAxisAlignment.start,
                  crossAxisAlignment: CrossAxisAlignment.start,
                  children: [
                    Text(
                      'How to reach (पहुँचने के लिए कैसे करें) :-',
                      textAlign: TextAlign.start,
                      style:
                          TextStyle(fontSize: 20, fontWeight: FontWeight.bold),
                    ),
                    SizedBox(
                      height: 5,
                    ),
                    Row(
                      children: [
                        Icon(
                          Icons.flight,
                          color: Colors.deepPurple,
                          size: 30,
                        ),
                        SizedBox(
                          width: 5,
                        ),
                        Text(
                          'By Air (हवाई मार्ग द्वारा) :-',
                          textAlign: TextAlign.start,
                          style: TextStyle(
                              fontSize: 18, fontWeight: FontWeight.bold),
                        ),
                      ],
                    ),
                    SizedBox(
                      height: 3,
                    ),
                    Text(
                      'निकटतम हवाई अड्डा रायपुर (300km) है जो मुंबई, दिल्ली, नागपुर, कोलकाता, हैदराबाद, बेंगलुरु, विशाखापत्तनम और चेन्नई से जुड़ा है।',
                      textAlign: TextAlign.start,
                      style: TextStyle(fontSize: 16),
                    ),
                    SizedBox(
                      height: 5,
                    ),
                    Row(
                      children: [
                        Icon(
                          Icons.train,
                          color: Colors.deepPurple,
                          size: 30,
                        ),
                        SizedBox(
                          width: 5,
                        ),
                        Text(
                          'By Train (रेल द्वारा) :-',
                          textAlign: TextAlign.start,
                          style: TextStyle(
                              fontSize: 18, fontWeight: FontWeight.bold),
                        ),
                      ],
                    ),
                    SizedBox(
                      height: 3,
                    ),
                    Text(
                      'रायपुर रेलवे स्टेशन बॉम्बे-हावड़ा मुख्य लाइन पर स्थित है।',
                      textAlign: TextAlign.start,
                      style: TextStyle(fontSize: 16),
                    ),
                    SizedBox(
                      height: 5,
                    ),
                    Row(
                      children: [
                        Icon(
                          Icons.time_to_leave,
                          color: Colors.deepPurple,
                          size: 30,
                        ),
                        SizedBox(
                          width: 5,
                        ),
                        Text(
                          'By Bus (सड़क मार्ग से:) :-',
                          textAlign: TextAlign.start,
                          style: TextStyle(
                            fontSize: 18,
                            fontWeight: FontWeight.bold,
                          ),
                        ),
                      ],
                    ),
                    SizedBox(
                      height: 3,
                    ),
                    Text(
                      'रायपुर से बस्तर के लिए नियमित बसें हैं। स्थानीय टैक्सी और जीपें भी उपलब्ध हैं।',
                      textAlign: TextAlign.start,
                      style: TextStyle(fontSize: 16),
                    ),
                  ],
                ),
              ),
            ),
            Padding(
              padding: const EdgeInsets.all(13.0),
              child: Container(
                height: 300,
                child: GridView.builder(
                  scrollDirection: Axis.horizontal,
                  gridDelegate: const SliverGridDelegateWithFixedCrossAxisCount(
                      crossAxisCount: 1, mainAxisSpacing: 11),
                  itemCount: listCat.length,
                  itemBuilder: (context, index) {
                    return InkWell(
                      onTap: () {
                        Navigator.push(
                          context,
                          MaterialPageRoute(
                            builder: (context) => VisitPlaces(
                              title: "${listCat[index]['place_name']}",
                              imgplace: '${listCat[index]['place_img']}',
                              historicalPlaces:
                                  '${listCat[index]['history_place']}',
                            ),
                          ),
                        );
                      },
                      child: Container(
                        margin: const EdgeInsets.all(10),
                        decoration: BoxDecoration(
                          borderRadius: BorderRadius.circular(20),
                          boxShadow: [
                            const BoxShadow(
                              offset: Offset(.5, -.5),
                              blurRadius: 8,
                              spreadRadius: 2,
                              color: Colors.grey,
                            ),
                          ],
                          image: DecorationImage(
                            fit: BoxFit.cover,
                            image: AssetImage('${listCat[index]['place_img']}'),
                          ),
                        ),
                        child: Align(
                          alignment: Alignment.bottomCenter,
                          child: Container(
                            padding: const EdgeInsets.only(top: 8, bottom: 8),
                            width: double.infinity,
                            decoration: const BoxDecoration(
                              color: Colors.white,
                              borderRadius: BorderRadius.vertical(
                                bottom: Radius.circular(20),
                              ),
                            ),
                            child: Text(
                              '${listCat[index]['place_name']}',
                              style: const TextStyle(
                                fontSize: 18,
                                fontWeight: FontWeight.bold,
                              ),
                              textAlign: TextAlign.center,
                            ),
                          ),
                        ),
                      ),
                    );

                    // Row(
                    //   children: [
                    //     Image.asset(
                    //       'assets/images/img_budha_talab.jpg',
                    //     ),
                    //     Image.asset(
                    //       'assets/images/img_energy_park.webp',
                    //     ),
                    //     Image.asset(
                    //       'assets/images/img_math.jpg',
                    //     ),
                    //     Image.asset(
                    //       'assets/images/img_raipur.png',
                    //     ),
                    //     Image.asset(
                    //       'assets/images/img_muesum_raipur.jpg',
                    //     ),
                    //   ],
                    // );
                  },
                ),
              ),
            ),
          ],
        ),
      ),
    );
  }
}
