import 'package:flutter/material.dart';

import 'visit_places_list.dart';

class BilaspurCity extends StatelessWidget {
  String title;
  String image_city;

  BilaspurCity({required this.title, required this.image_city});

  List<Map<String, String>> listCat = [
    {
      'place_img': 'assets/images/img_mahayama_bilas.png',
      'place_name': "Ratanpur(Maa Mahamaya Temple)",
      'history_place':
          "बिलासपुर – कोरबा मुख्यमार्ग पर 25 कि.मी. पर स्थित आदिशक्ति महामया देवि कि पवित्र पौराणिक नगरी रतनपुर का प्राचीन एवं गौरवशाली इतिहास है। त्रिपुरी के कलचुरियो ने रतनपुर को अपनी राजधानी बना कर दीर्घकाल तक छ्.ग. मे शासन किया। इसे चतुर्युगी नगरी भी कहा जाता है. जिसका तात्पर्य इसका अस्तित्व चारो युगों में विद्यमान  रहा है | राजा रत्नदेव प्रथम ने रतनपुर के नाम से अपनी राजधानी बसाया |\n\n\nश्री आदिशक्ति  माँ महामाया देवी :- लगभग नौ वर्ष प्राचीन महामाया देवी का दिव्य एवं भव्य मंदिर दर्शनीय है | इसका निर्माण राजा रत्नदेव प्रथम द्वारा ग्यारहवी शताबदी में कराया गया था | १०४५ ई. में राजा रत्नदेव प्रथम मणिपुर नामक गाँव में  शिकार के लिए आये थे, जहा रात्रि विश्राम उन्होंने एक वटवृक्ष पर किया | अर्ध रात्रि में जब राजा की आंखे खुली, तब उन्होंने वटवृक्ष के नीचे अलौकिक प्रकाश देखा | यह देखकर चमत्कृत हो गई की वह आदिशक्ति श्री महामाया देवी की सभा लगी हुई है | इसे देखकर वे अपनी चेतना खो बैठे |सुबह होने पर वे अपनी राजधानी तुम्मान खोल लौट गये और रतनपुर को अपनी राजधानी बनाने का निर्णय लिया गया तथा १०५०ई. में श्री महामाया देवी का भव्य मंदिर निर्मित कराया गया | मंदिर के भीतर महाकाली,महासरस्वती और महालक्ष्मी स्वरुप देवी की प्रतिमाए विराजमान है| मान्यता है कि इस मंदिर में यंत्र-मंत्र का केंद्र रहा होगा | रतनपुर में देवी सती का दाहिना स्कंद गिरा था | भगवन शिव ने स्वयं आविर्भूत होकर उसे कौमारी शक्ति पीठ का नाम दिया था | जिसके कारण माँ  के दर्शन से कुंवारी कन्याओ को सौभाग्य की प्राप्ति होती है | नवरात्री पर्व पर यहाँ की छटा दर्शनीय होती है | इस अवसर पर श्रद्धालूओं द्वारा यहाँ हजारो की संख्या में मनोकामना ज्योति कलश प्रज्जवलित किये जाते है |"
    },
    {
      'place_img': 'assets/images/img_tala.jpg',
      'place_name': "Tala",
      'history_place':
          "ताला के पास सरगांव में धूम नाथ का मंदिर है। इस मंदिर में भगवान किरारी के शिव स्मारक हैं, और मल्हार यहां से केवल 18 किमी दूर है। ताला बहुमूल्य पुरातात्विक खुदाई की भूमि है जिसने उत्कृष्ट मूर्तिकला के काम को प्रकट किया है। पुरातत्त्वविदों और इतिहासकारों को जटिल रूप से तैयार पत्थर की नक्काशी से मंत्रमुग्ध कर दिया जाता है। इन उत्कृष्ट खुदाई 6 वीं से 10 वीं शताब्दी ईस्वी के दौरान ताला की समृद्धि का वर्णन करती हैं। हालांकि, विभिन्न खुदाई वाले खंडहर प्राप्त हुए और मूर्तिकला-शैली हमें विभिन्न राजवंशों को बताती है जो ताला में शासन करते थे और भगवान शिव के भक्त और शिव धर्म के प्रचारक थे। शायद, यही कारण है कि आज भी शिव भक्त विभिन्न अनुष्ठान करने और पवित्र महामृत्यजय मंत्र का जप करने के लिए यहां मंदिरों को ढूंढ लेते हैं। भगवान शिव के भक्त यहां अपनी प्रार्थनाएं देते हैं और अन्य खुदाई का दौरा भी पसंद करते हैं। ताला निषाद समाज द्वारा निर्मित विभिन्न मंदिरों का भी घर है, जिसमें राम-जानकी मंदिर, स्वामी पूर्णानंद महाजन मंदिर और गोशाला शामिल हैं।\n\nदेवरानी – जेठानी मंदिर, अमेरीकांपा (जिला बिलासपुर) प्राचीन काल में दक्षिण कोसल के शरभपुरीय राजाओं के राजत्वकाल में मनियारी नदी के तट पर ताला नामक स्थल पर अमेरिकापा गाँव के समीप दो शिव मंदिरों का निर्माण कराया गया था जिनका संछिप्त विवरण निम्नानुसार है –\n\n\nदेवरानी मंदिर – इन मंदिरो प्रस्तोर निर्मित अर्ध भग्नि देवरानी मंदिर, शिव मंदिर है जिसका मुख पूर्व दिशा की ओर है।इस मंदिर के पिछे की तरफ शिवनाथ की सहायक नदी मनियारी प्रवाहित हो रही है |इस मंदिर का माप बाहर की ओर से 7532 फीट है जिसका भुविन्यास अनूठा है | इसमें गर्भगृह ,अन्तराल एवं खुली जगहयुक्त संकरा मुखमंड़प है |मंदिर में पहुच के के लिए मंदिर द्वार की चंद्रशिलायुक्त देहरी तक सीढ़ियाँ निर्मित है||मुख मंडप में प्रवेश द्वार है |मन्दिरं की द्वारसखाओं पर नदी देवियो का अंकन है |सिरदल में ललाट बिम्ब में गजलक्ष्मी का अंकन है | इस मंदिर में उपलब्ध भित्तियो की उचाई 10 फीट है इसमें शिखर अथवा छत का आभाव है इस मंदिर स्थली से हिन्दू मत के विभन्न देवी-देवताओं ,वयंतर देवता,पशु ,पोराणिक आकृतिया ,पुष्पांकन एवं विविध ज्यामितिक एवं अज्यामितिक प्रतिको के अंकनयुक्त प्रतिमाये एवं वास्तुखंड प्राप्त हुए है |\n\n\nजेठानी मंदिर – दक्षिणाभीमुखी यह भगवान शिव को समर्पित है। भग्नाोवशेष के रूप में ज्ञात संरचना उत्खननन से अनावृत किया गया है। किन्तु कोई भी इसे देखकर इसकी भू-निर्माण योजना के विषय में जान सकता है।सामने इसके गर्भगृह एवं मंडप है जिसमे पहुँचाने के लिए दक्षिण, पूर्व एवं पश्चिम दिशा से प्रविष्ट होते थे |मंदिर का प्रमुख प्रवेश द्वार चौड़ी सीढियों से सम्बन्ध था |इसके चारों ओर बड़े एवं मोटे स्तंभों की यष्टियां बिखरी पड़ी हुई है और ये उनके प्रतीकों के अन्कंयुक्त है| स्तंभ के निचले भाग पर कुम्भ बने हुए है | स्तंभों के ऊपरी भाग पर कुम्भ आमलक घट पर आधारित दर्शाया गया है जो कीर्तिमुख से निकली हुई लतावल्लरी से अलंकृत है |मंदिर का गर्भगृह वाला भाग बहुत अधिक क्षतिग्रस्त है और मंदिर के ऊपरी शिखर भाग के कोई प्रणाम प्राप्त नहीं हुए हैं | दिग्पाल देवता या गजमुख चबूतरे पर निर्मित किये गये है निःसंदेह ताला स्तिथ स्मारकों के अवशेष भारतीय स्थापत्यकला के विलक्षण उदहारण है | छत्तीसगढ़ के स्थासपत्यअ कला की मौलिक्ताा इसके पाषाण खण्डा में जिवित हो उठी है।\n\n\nदुर्लभ रुद्रशिव:देवरानी-जेठानी मंदिर भारतीय मूर्तिकला और कला के लिए बहुत प्रसिद्ध है। 1987-88 के दौरान था देवरानी मंदिर में प्रसिद्ध खुदाई में भगवान शिव की एक बेहद अनोखी ‘रुद्र’ छवि वाली मूर्ति प्रकट हुई।\n\n\nशिव हमें भगवान के व्यक्तित्व के विभिन्न रंगों में एक झलक देता है। शैव धर्म के संबंध में, शिव की यह अनूठी मूर्ति विभिन्न प्राणियों का उपयोग करके तैयार की जाती है। प्रतीत होता है कि मूर्तिकार ने अपने शरीर रचना का हिस्सा बनने के लिए हर कल्पनीय प्राणी का उपयोग किया है, जिसमें से नाग एक पसंदीदा प्रतीत होता है। कोई भी ऐसा महसूस कर सकता है जैसे पृथ्वी पर जीवन के विकास को इस सृजन के लिए थीम के रूप में लिया जाता है। अपने विभिन्न शारीरिक भागों में आ रहे हैं, हम शायद ऊपर से धीरे-धीरे नीचे से शुरू हो सकते हैं।\n\n\nरूद्रशिव के नाम से संबोधित की जाने वाली एक प्रतिमा सर्वाधिक महत्वापूर्ण है। यह विशाल एकाश्ममक द्विभूजी प्रतिमा समभंगमुद्रा में खड़ी है तथा इसकी उचांर्इ 2.70 मीटर है। यह प्रतिमा शास्त्र के लक्षणों की दृष्टी से विलक्षण प्रतिमा है | इसमें मानव अंग के रूप में अनेक पशु, मानव अथवा देवमुख एवं सिंह मुख बनाये गये है | इसके सिर का जटामुकुट (पगड़ी) जोड़ा सर्पों से निर्मित है | ऐसा प्रतीत होता है कि यहाँ के कलाकार को सर्प-आभूषण बहुत प्रिय था क्योंकि प्रतिमा में रुद्रशिव का कटी, हाथ एवं अंगुलियों को सर्प के भांति आकार दिया गया है | इसके अतिरिक्त प्रतिमा के ऊपरी भाग पर दोनों ओर एक-एक सर्पफण छत्र कंधो के ऊपर प्रदर्शित है | इसी तरह बायें पैर लिपटे हुए, फणयुक्त सर्प का अंकन है |दुसरे जीव जन्तुओ में मोर से कान एवं कुंडल, आँखों की भौहे एवं नाक छिपकली से,मुख की ठुड्डी केकड़ा से निर्मित है तथा भुजायें मकरमुख से निकली हैं | सात मानव अथवा देवमुख शरीर के विभिन अंगो में निर्मित हैं |ऊपर बतलाये अनुसार अद्वितीय होने के कारण विद्वानों के बीच इस प्रतिमा की सही पहचान को लेकर अभी भी विवाद बना हुआ है | शिव के किसी भी ज्ञात स्वरुप के शास्त्रोक्त प्रतिमा लक्षण पूर्ण रूप से न मिलने के कारण इसे शिव के किसी स्वरुप विशेष की प्रतिमा के रूप में अभिरान सर्वमान्य नहीं है | निर्माण शैली के आधार पर ताला के पुरावशेषों को छठी शती ईसवीं के पूर्वाद्ध में रखा जा सकता है |"
    },
    {
      'place_img': 'assets/images/img_luthra.jpg',
      'place_name': "Luthra Sharif",
      'history_place':
          "बाबा सैय्यद इंसान अली शाह की दरगाह के रूप में प्रसिद्ध “लुतरा शरीफ” बिलासपुर में स्थित है। जो पुरे छत्तीसगढ़ में धार्मिक सौहार्द्र, श्रध्दा और आस्था का पावन स्थल तथा प्रमुख केंद्र माना जाता है।\n\n\nप्रसिद्ध –लुतरा बाबा के दरगाह से कोई भी खाली हाथ नहीं जाता, ऐसी मान्यता है कि बाबा के मजार में मत्था टेकने वालो की मनौतिया अवश्य पूरी होती है। सभी धर्मो के अनुयायी यहाँ आकर अपनी मनौतिया के लिए चादर चढ़ाते है । इस कारण यह लुतरा शरीफ अंचल में आस्था के केंद्र के रूप में प्रसिद्ध है ।\n\n\nऐतिहासिक –बिलासपुर से सीपत बलौदा मार्ग पर ग्राम – लुतरा स्थित है । कहा जाता है हजरत शाह बाबा सैय्यद इंसान अली अलैह रहमतुल्ला का जन्म सन 1845 में एक मुस्लिम परिवार में हुआ था । इनके पिता का नामसैय्यद मरदान अली था, वंशावली के अनुसार बाबा इंसान अली के दादा का नाम जौहर अली था तथा इनके परदादा सैय्यद हैदर अली साहब हुए । बाबा इंसान अली की माँ का नाम बेगमजान और उनके नाना के नाम ताहिर अली साहब था । बाबा इंसान अली के नाना ताहिर अली धार्मिक प्रवृत्ति के इंसान थे । वे धर्म के प्रति गहरी आस्था रखते थे । उन्हें जीवन में पैदल हज यात्रा करने का गौरव प्राप्त हुआ था । सैय्यद इंसान अली पर उनके नाना के विचारधारा का पड़ना स्वाभाविक था क्योंकि इनका ज्यादा समय ननिहाल में ही बिता था और यही बालक आगे चल के हजरत बाबा सैय्यद इंसान अली के नाम से लुतरा शरीफ में प्रसिद्ध हुए ।"
    },
    {
      'place_img': 'assets/images/img_mahaal.jpg',
      'place_name': "Malhar",
      'history_place':
          "मल्हार नगर बिलासपुर से दक्षिण- पश्चिम में बिलासपुर से शिवरीनारायण जाने वाली सडक पर स्थित मस्तूरी से 14 कि.मी. की दूरी पर स्थित है। बिलासपुर जिले में 21.55°  अक्षांस उत्तर एवं 82.20° देशांतर पूर्व में स्थित मल्हार में ताम्र पाषाण काल से लेकर मध्यकाल तक का इतिहास सजीव हो उठता है। कौशमबी से दक्षिण-पूर्वी समुद्र तट की ओर जाने वाला प्राचीन मार्ग भरहुत, बांधवगढ़, अमरकंटक, खरोद, मल्हाशर तथा सिरपुर होकर जगन्नाथपुरी की ओर जाता था। मल्हार के उत्खनन में ईसा की दूसरी शती की ब्राम्हीव लिपी में आलेखित उक मृणमुद्रा प्राप्त हुई है, जिस पर गामस कोसलीाया (कोसली ग्राम की) लिखा है। कोसली या कोसल ग्राम का तादात्यपी मल्हार से 16 किमी उत्त‍र पूर्व में स्थित कोसला ग्राम से स्थित जा सकता है। कोसला गांव से पुराना गढ़ प्राचीर तथा परिखा आज भी विद्यमान है, जो उसकी प्राचीनता को मौर्यो के समयुगीन ले जाती है।वहां कुषाण शासक विमकैडफाइसिस का एक सिक्का भी मिला है।\n\n\nसातवाहन वंश- सातवाहन शासकों की गजांकित मुद्रायें मल्हा र-उत्खचनन से प्राप्ते हुई है। रायगढ़ जिला के बालपुर ग्राम से सातवाहन शासक अपीलक का सिकका प्राप्तक हुआ था। वेदिश्री के नाम की मृण्मु द्रा मल्हा‍र में प्राप्ता हुई है। इसके अतिरिक्ते सातवाहन कालीन कई अभिलेख गुंजी, किरारी, मल्हािर, सेमरसल, दुर्ग आदि स्थालों से प्राप्त दुउ है। छत्तीेसगढ़ क्षेत्र से कुषाण – शासकों के सिक्केग भी मिले है। उनमं विमकैड्फाइसिस तथा कनिष्क प्रथम के सिक्केर उल्ले‍खनीय है। यौधेयों के भी कुछ सिक्केन इस क्षेत्र में उपलब्धी हुए है। मल्हाफर उत्खिनन से ज्ञात हुआ है, कि इस क्षेत्र में सुनियोजित नगर-निर्माण का प्रारंभ सातवाहन-काल में हुआ। इस काल के ईट से बने भवन एवं ठम्मंसकित मृदभाण्डन यहां मिलते है।मल्हार क गढ़ी छेत्र में राजमहल एवं अन्य संभ्रांतजनों क आवास रहे होंगे|\n\n\nशरभपुरिय राजवंस – दक्षिण कोसल में कलचुरि शासक के पहले दो प्रमुख राजवंशो का शासन रहा | वे हैं,शरभपुरिय तथा सोमवंशी | इन दिनों वंशो का राज्यकाल लगभग 425 से 655 ई. के बीच रखा जा सकता है | यह काल छत्तीसगढ़ के इतिहस का स्वर्ण युग कहा जा सकता है | धार्मिक तथा ललित कला के पांच मुख्य केंद्र विकसित हुए 1 मल्हार 2 ताला 3 खरोद 4 सिरपुर 5 राजिम |\n\n\nकलचुरि वंश- नवीं शती के उत्तरार्ध में त्रिपुरी के कलचुरि शासक कोकल्लदेव प्रथम के पुत्र शंकरगढ़ (मुग्धतुंग) ने डाहल मंडल से कोसल पर आक्रमण किया | पाली पर विजय प्राप्त करने के बाद उसने अपने छोटे भाई को तुम्माण का शासक बना दिया | कलचुरियो की यह विजय स्थायी नहीं रह पायी | सोमवंश शासक अब तक काफी प्रबल हो गये थे |उन्होंने तुम्माण से कलचुरियो को निष्कासित कर दिया | लगभग ई.1000 में कोकल्लदेव द्वितीय के 18 पुत्रो में से एक पुत्र कलिंगराज ने दक्षिण कोसल पर पुनः तुम्माण को कलचुरियो की राजधानी बनाया | कलिंगराज के पश्चात कमलराज,रत्नराज प्रथम तथा क्रमशः कोसल के शासक बने | मल्हार पर सर्वप्रथम कलचुरी-वंश का शासन जाजल्लदेव में स्थापित हुवा | पृथ्वीदेव द्वितीय के राजत्वाकाल में मल्हार पर कलचुरियो का मांडलिक शासक ब्रम्हदेव था | पृथ्वीदेव के पश्चात उसके पुत्र जाजल्लदेव द्वितीय के समय में सोमराज नामक ब्राम्हाण ने मल्हार में प्रसिद्ध केदारेश्वर मंदिर का निर्माण कराया | यह मंदिर अब पातालेश्वर मंदिर के नाम से प्रसिद्ध है |\n\n\nमराठा शासन- कलचुरि वंश का अंतिम शासक रघुनाथ सिंह था | ई.1742 में नागपुर का रघुजी भोंसले अपने सेनापति भास्कर पन्त के नेतृत्वा में उड़ीसा तथा बंगाल पर विजय हेतु छत्तीसगढ़ से गुजरा | उसने रतनपुर पर अक्रमण किया तथा उस पर विजय प्राप्त कर ली | इस प्रकार छत्तीसगढ़ से हैह्य वंशी कलचुरियो का शासन लगभग सात शाताब्दियो पश्चात समाप्त हो गया |\n\n\nकला – उत्तर भारत से दक्षिण पूर्व की ओर जाने वाले प्रमुख मार्ग पर स्थित होने के करण मल्हार का महत्व बढ़ा | यह नगर धीरे-धीरे विकसित हुआ तथा वहां शैव ,वैष्षव तथा जैन धर्मावालंबियो के मंदिरो,मठो मूर्तियों का निर्माण बड़े रूप हुआ | मल्हार में चतुर्भज विष्णुकी एक अद्वितीय प्रतिमा मिली है | उस पर मौर्याकालीन ब्राम्हीलिपि में लेख अंकित है | इसका निर्माण काल लगभग ई.पूर्व 200 है |मल्हार तथा उसके समीपवर्ती क्षेत्र से विशेषतः शैव मंदिरों के अवशेस मिले है जिनसे इस क्षेत्र में शैवधर्म के विशेस उत्थान का पता चला | इसवी पांचवी से सातवी सदी तक निर्मित शिव,कर्तिकेय,गणेश,स्कन्द माता,अर्धनारीश्वर आदि की उल्लेखनीय मुर्तिया यहाँ प्राप्त हुई है | एक शिल्लापट पर कच्छप जातक की कथा अंकित है | शिल्लापट पर सूखे तालाब से एक कछुए को उड़ा कर जलाशय की और ले जाते हुए दो हंस बने है | दूसरी कथा उलूक-जातक की है | इसमें उल्लू को पक्षियों का राजा बनाने के लिए सिंहासन पर बैठाया गया |\n\n\nसातवी से दसवी शती के मध्य विकसित मल्हार की मूर्तिकला में उत्तर गुप्त युगिन विशेषताए स्पष्ट परिलक्षित है | मल्हार में बौद्ध स्मारकों तथा प्रतिमाओ का निर्माण इस काल की विशेषता है|"
    },
    {
      'place_img': 'assets/images/img_kaanan.jpg',
      'place_name': "Kanan Pendari",
      'history_place':
          "बिलासपुर शहर कानन पेंडारी चिड़ियाघर के लिए प्रसिद्ध है। यह मुंगेली रोड पर बिलासपुर से लगभग 10 किलोमीटर सकरी के पास स्थित एक छोटा चिड़ियाघर है।\n\nसिटी बस का संचालन बिलासपुर सिटी बस लिमिटेड द्वारा यात्रियों के परिवहन के लिए किया जाता है।"
    },
  ];

  @override
  Widget build(BuildContext context) {
    listCat.shuffle();
    return Scaffold(
      appBar: AppBar(
        title: Text(
          title,
          style: const TextStyle(
            fontSize: 25,
            fontWeight: FontWeight.bold,
          ),
        ),
      ),
      body: SingleChildScrollView(
        child: Column(
          children: [
            Image.asset(
              '$image_city',
            ),
            const SizedBox(
              height: 10,
            ),
            Padding(
              padding: const EdgeInsets.all(13.0),
              child: Container(
                padding: const EdgeInsets.all(10),
                decoration: BoxDecoration(
                  borderRadius: BorderRadius.circular(15),
                  color: Colors.white,
                  boxShadow: const [
                    BoxShadow(
                      offset: Offset(2, 2),
                      blurRadius: 8,
                      // spreadRadius: 2,
                      color: Colors.grey,
                    ),
                  ],
                ),
                child: const Column(
                  mainAxisAlignment: MainAxisAlignment.start,
                  crossAxisAlignment: CrossAxisAlignment.start,
                  children: [
                    Text(
                      'History :-',
                      textAlign: TextAlign.start,
                      style:
                          TextStyle(fontSize: 22, fontWeight: FontWeight.bold),
                    ),
                    SizedBox(
                      height: 5,
                    ),
                    Text(
                      "ऐतिहासिक रूप से, बिलासपुर को रतनपुर के कल्चुरि राजवंश द्वारा नियंत्रित किया गया था। हालांकि, बिलासपुर शहर, मराठा साम्राज्य के शासनकाल में वर्ष 1741 के आसपास प्रमुखता से आया। बिलासपुर शहर लगभग 400 वर्ष पुराना है और “बिलासपुर” का नाम “बिलासा” नामक फिशर-महिला के नाम पर पड़ा है।\n\n\nबिलासपुर जिला वर्ष 1861 में गठित किया गया और इसके बाद वर्ष 1867 में बिलासपुर नगर पालिका का गठन किया गया। बिलासपुर जिला न केवल छत्तीसगढ़ राज्य में प्रसिद्ध है बल्कि चावल की गुणवत्ता, कोसा उद्योग और इसकी सांस्कृतिक पृष्ठभूमि जैसी अनूठी विशेषताओं के कारण भारत में प्रसिद्ध है। पूरे छत्तीसगढ़ राज्य के लिए बिलासपुर जिले को “धान का कटोरा”  के नाम से जाना जाता है।",
                      textAlign: TextAlign.start,
                      style: TextStyle(
                        fontSize: 18,
                      ),
                    ),
                  ],
                ),
              ),
            ),
            Padding(
              padding: const EdgeInsets.all(13.0),
              child: Container(
                padding: const EdgeInsets.all(10),
                decoration: BoxDecoration(
                  borderRadius: BorderRadius.circular(15),
                  color: Colors.white,
                  boxShadow: [
                    const BoxShadow(
                      offset: Offset(2, 2),
                      blurRadius: 8,
                      // spreadRadius: 2,
                      color: Colors.grey,
                    ),
                  ],
                ),
                child: const SizedBox(
                  width: double.infinity,
                  child: Row(
                    mainAxisAlignment: MainAxisAlignment.spaceEvenly,
                    crossAxisAlignment: CrossAxisAlignment.start,
                    children: [
                      Icon(
                        Icons.access_time,
                        size: 50,
                        color: Colors.deepPurple,
                      ),
                      Column(
                        children: [
                          Text(
                            'Traveling Best Time  ',
                            textAlign: TextAlign.start,
                            style: TextStyle(
                                fontSize: 22, fontWeight: FontWeight.bold),
                          ),
                          SizedBox(
                            height: 5,
                          ),
                          Center(
                            child: Text(
                              'July to January',
                              textAlign: TextAlign.start,
                              style: TextStyle(
                                fontSize: 18,
                                fontWeight: FontWeight.w600,
                              ),
                            ),
                          ),
                        ],
                      ),
                    ],
                  ),
                ),
              ),
            ),
            Padding(
              padding: const EdgeInsets.all(13.0),
              child: Container(
                padding: const EdgeInsets.all(10),
                decoration: BoxDecoration(
                  borderRadius: BorderRadius.circular(15),
                  color: Colors.white,
                  boxShadow: [
                    const BoxShadow(
                      offset: Offset(2, 2),
                      blurRadius: 8,
                      // spreadRadius: 2,
                      color: Colors.grey,
                    ),
                  ],
                ),
                child: const Column(
                  mainAxisAlignment: MainAxisAlignment.start,
                  crossAxisAlignment: CrossAxisAlignment.start,
                  children: [
                    Text(
                      'How to reach (पहुँचने के लिए कैसे करें) :-',
                      textAlign: TextAlign.start,
                      style:
                          TextStyle(fontSize: 20, fontWeight: FontWeight.bold),
                    ),
                    SizedBox(
                      height: 5,
                    ),
                    Row(
                      children: [
                        Icon(
                          Icons.flight,
                          color: Colors.deepPurple,
                          size: 30,
                        ),
                        SizedBox(
                          width: 5,
                        ),
                        Text(
                          'By Air (हवाई मार्ग द्वारा) :-',
                          textAlign: TextAlign.start,
                          style: TextStyle(
                              fontSize: 18, fontWeight: FontWeight.bold),
                        ),
                      ],
                    ),
                    SizedBox(
                      height: 3,
                    ),
                    Text(
                      'निकटतम हवाई अड्डा रायपुर (120km) है जो मुंबई, दिल्ली, नागपुर, कोलकाता, हैदराबाद, बेंगलुरु, विशाखापत्तनम और चेन्नई से जुड़ा है।',
                      textAlign: TextAlign.start,
                      style: TextStyle(fontSize: 16),
                    ),
                    SizedBox(
                      height: 5,
                    ),
                    Row(
                      children: [
                        Icon(
                          Icons.train,
                          color: Colors.deepPurple,
                          size: 30,
                        ),
                        SizedBox(
                          width: 5,
                        ),
                        Text(
                          'By Train (रेल द्वारा) :-',
                          textAlign: TextAlign.start,
                          style: TextStyle(
                              fontSize: 18, fontWeight: FontWeight.bold),
                        ),
                      ],
                    ),
                    SizedBox(
                      height: 3,
                    ),
                    Text(
                      'बिलासपुर रेलवे स्टेशन बॉम्बे-हावड़ा मुख्य लाइन पर स्थित है।',
                      textAlign: TextAlign.start,
                      style: TextStyle(fontSize: 16),
                    ),
                    SizedBox(
                      height: 5,
                    ),
                    Row(
                      children: [
                        Icon(
                          Icons.time_to_leave,
                          color: Colors.deepPurple,
                          size: 30,
                        ),
                        SizedBox(
                          width: 5,
                        ),
                        Text(
                          'By Bus (सड़क मार्ग से:) :-',
                          textAlign: TextAlign.start,
                          style: TextStyle(
                            fontSize: 18,
                            fontWeight: FontWeight.bold,
                          ),
                        ),
                      ],
                    ),
                    SizedBox(
                      height: 3,
                    ),
                    Text(
                      'रायपुर से बिलासपुर (120km) के लिए नियमित बसें हैं। स्थानीय टैक्सी और जीपें भी उपलब्ध हैं।',
                      textAlign: TextAlign.start,
                      style: TextStyle(fontSize: 16),
                    ),
                  ],
                ),
              ),
            ),
            Padding(
              padding: const EdgeInsets.all(13.0),
              child: Container(
                height: 300,
                child: GridView.builder(
                  scrollDirection: Axis.horizontal,
                  gridDelegate: const SliverGridDelegateWithFixedCrossAxisCount(
                      crossAxisCount: 1, mainAxisSpacing: 11),
                  itemCount: listCat.length,
                  itemBuilder: (context, index) {
                    return InkWell(
                      onTap: () {
                        Navigator.push(
                          context,
                          MaterialPageRoute(
                            builder: (context) => VisitPlaces(
                              title: "${listCat[index]['place_name']}",
                              imgplace: '${listCat[index]['place_img']}',
                              historicalPlaces:
                                  '${listCat[index]['history_place']}',
                            ),
                          ),
                        );
                      },
                      child: Container(
                        margin: const EdgeInsets.all(10),
                        decoration: BoxDecoration(
                          borderRadius: BorderRadius.circular(20),
                          boxShadow: const [
                            BoxShadow(
                              offset: Offset(.5, -.5),
                              blurRadius: 8,
                              spreadRadius: 2,
                              color: Colors.grey,
                            ),
                          ],
                          image: DecorationImage(
                            fit: BoxFit.cover,
                            image: AssetImage('${listCat[index]['place_img']}'),
                          ),
                        ),
                        child: Align(
                          alignment: Alignment.bottomCenter,
                          child: Container(
                            padding: const EdgeInsets.only(top: 8, bottom: 8),
                            width: double.infinity,
                            decoration: const BoxDecoration(
                              color: Colors.white,
                              borderRadius: BorderRadius.vertical(
                                bottom: Radius.circular(20),
                              ),
                            ),
                            child: Text(
                              '${listCat[index]['place_name']}',
                              style: const TextStyle(
                                fontSize: 18,
                                fontWeight: FontWeight.bold,
                              ),
                              textAlign: TextAlign.center,
                            ),
                          ),
                        ),
                      ),
                    );

                    // Row(
                    //   children: [
                    //     Image.asset(
                    //       'assets/images/img_budha_talab.jpg',
                    //     ),
                    //     Image.asset(
                    //       'assets/images/img_energy_park.webp',
                    //     ),
                    //     Image.asset(
                    //       'assets/images/img_math.jpg',
                    //     ),
                    //     Image.asset(
                    //       'assets/images/img_raipur.png',
                    //     ),
                    //     Image.asset(
                    //       'assets/images/img_muesum_raipur.jpg',
                    //     ),
                    //   ],
                    // );
                  },
                ),
              ),
            ),
          ],
        ),
      ),
    );
  }
}
